app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-07 20:23:42.264205"], ["movie_id", 6], ["updated_at", "2015-01-07 20:23:42.264205"], ["user_id", 1]]
---
	def create
		@movie.favorites.create!(user: current_user)

SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 1], ["id", 2]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 2]]
---
	def destroy
	  favorite = current_user.favorites.find(params[:id])
	  favorite.destroy