app/controllers/reviews_controller.rb

  def create
    @review = @movie.reviews.new(review_params)
    @review.user = current_user
    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "stars", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Cool movie!"], ["created_at", "2014-12-20 01:34:13.488590"], ["movie_id", 6], ["stars", 5], ["updated_at", "2014-12-20 01:34:13.488590"], ["user_id", 10]]